{
  "id": "Mc5SyHmQQDE",
  "title": "Los Angeles Fire LIVE Update | Widespread Power Outages In Los Angeles | Tent Cities Come Up | N18G",
  "description": "Aerial footage of Los Angeles on Sunday (January 12) night showed a sprawling tent city emerging as thousands of people seek refuge in makeshift shelters, while suburbs lie in darkness, devoid of power, in the aftermath of devastating wildfires that ravaged California.\n\nThe Los Angeles wildfires have left a trail of destruction, killing at least 24 people and destroying thousands of structures, officials said. Although containing the deadly infernos has been difficult and will remain so as ominous new wind warnings were issued for Southern California communities. Here are latest updates on the most destructive in the history of Los Angeles which has scorched over 23,000 acres, destroying homes, businesses and numerous landmarks:\n\n1. Palisades Fire has expanded to the north and the east owing to which evacuation orders and warnings were issued to parts of Encino and Brentwood. The fire has been 13% contained so far.\n\n2. Officials said that Santa Ana winds that have fueled the blazes for the past week were picking up in Los Angeles and Ventura counties. The resurging winds could complicate efforts and enhance the risk level, officials warned as they forecast north-northeast wind gusts between 35 to 55 mph. A red flag warning is in effect until Wednesday as strong winds will be accompanied by low humidity and dry vegetation. \n\n3. Over 12,000 structures have been damaged or destroyed by the wildfires, which have consumed about 40,300 acres of total land.\n\n4. Evacuation orders have been given to 105,000 residents while another 87,000 residents have been warned that they may have to evacuate.\n\n5. Eaton fire has been contained 27% while Hurst fire has been stopped 89%. Three other blazes- Kenneth, Sunset, and Sunswept- have been contained completely.\n\n#losangelesfire #hollywoodhillsfire #californiawildfire #news18live\n\nn18oc_live\nn18oc_world \n\nNews18 Mobile App - https://onelink.to/desc-youtube",
  "thumbnails": {
    "default": "https://i.ytimg.com/vi/Mc5SyHmQQDE/default_live.jpg",
    "medium": "https://i.ytimg.com/vi/Mc5SyHmQQDE/mqdefault_live.jpg",
    "high": "https://i.ytimg.com/vi/Mc5SyHmQQDE/hqdefault_live.jpg",
    "maxres": "https://i.ytimg.com/vi/Mc5SyHmQQDE/maxresdefault_live.jpg"
  },
  "channelTitle": "CNN-News18",
  "startTime": "2025-01-13T12:08:46Z",
  "concurrentViewers": "498",
  "link": "https://www.youtube.com/watch?v=Mc5SyHmQQDE",
  "statistics": {
    "viewCount": "5146866",
    "likeCount": "21184",
    "commentCount": "0"
  }
}